app/controllers/api/v1/posters_controller.rb

  def index
    posters = Poster.search(params)
    render json: PosterSerializer.new(posters, meta:{count: posters.count})
---
SELECT "posters".* FROM "posters"
SELECT COUNT(*) FROM "posters" WHERE (name ILIKE $1)  [[nil, "%ter%"]]

  def show
    begin
      render json: PosterSerializer.new(Poster.find(params[:id]))
---
SELECT "posters".* FROM "posters" WHERE "posters"."id" = $1 LIMIT $2  [["id", 123456], ["LIMIT", 1]]

  def create
    begin
      poster = Poster.create!(poster_params)
---
INSERT INTO "posters" ("name", "description", "price", "year", "vintage", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    poster = Poster.find(params[:id])
    if poster.update(poster_params)
---
SELECT "posters".* FROM "posters" WHERE "posters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posters" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "posters"."id" = $4  [["name", "Apples"], ["description", "An apple in the morning has the same energy as a cup of coffee."], ["updated_at", "2024-10-23 20:27:43.297299"], ["id", 9]]

  def destroy
    poster = Poster.find(params[:id])
    poster.destroy
---
SELECT "posters".* FROM "posters" WHERE "posters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posters" WHERE "posters"."id" = $1  [["id", 8]]