app/controllers/api/v1/posters_controller.rb

INSERT INTO "posters" ("name", "description", "price", "year", "vintage", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    render json: Poster.create(poster_params)

UPDATE "posters" SET "name" = $1, "description" = $2, "price" = $3, "year" = $4, "vintage" = $5, "img_url" = $6, "updated_at" = $7 WHERE "posters"."id" = $8
---
  def update
    render json:Poster.update(params[:id], poster_params)