app/controllers/api/v1/posters_controller.rb

  def destroy
    poster = Poster.find(params[:id])
    poster.destroy
---
DELETE FROM "posters" WHERE "posters"."id" = $1  [["id", 9]]